Revit 2027 API
BuiltInFailures.HostedWallAssociationFailures.AssocToHostFailed Property
 Failed to pick the target wall as host wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AssocToHostFailed { get; }
Public Shared ReadOnly Property AssocToHostFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AssocToHostFailed {
	FailureDefinitionId^ get ();
}
static member AssocToHostFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.HostedWallAssociationFailures Class
Autodesk.Revit.DB Namespace